Repository: ywjno/mynes-code
Catalog: MyNes/Forms/FormAudioSettings.*.resx
Languages: ar_sy

# button1.Text
source: &Save
ar_sy: &حفظ

# button1.ToolTip
source: Save and apply
ar_sy: حفظ الخيارات و تفعيلها

# button2.Text
source: &Cancel
ar_sy: إل&غاء الأمر

# button2.ToolTip
source: Discard changes.
ar_sy: إلغاء الأمر و تجاهل التغيرات

# trackBar2.ToolTip
source: Volume level.
ar_sy: مستوى الصوت

# trackBar_latency.ToolTip
source: Latency between internal sound emulation output and sound playback output.
ar_sy: تأخير استجابة الصوت بالثانية. تغيير هذه القيمة مع تغيير قيمة طول المساحة المخصصة بالذاكرة قد تؤثر بشكل ملحوظ على دقة الصوت.

# button3.Text
source: &Defaults
ar_sy: إ&فتراضي

# button3.ToolTip
source: Restore default settings
ar_sy: إستعادة الإعدادات الافتراضية

# groupBox4.Text
source: Volume
ar_sy: مستوى الصوت

# groupBox1.Text
source: Buffer size
ar_sy: طول المساحة المخصصة بالذاكرة بالثانية

# groupBox2.Text
source: Sound playback
ar_sy: التأخير بالثانية

# groupBox3.Text
source: Channels
ar_sy: قنوات الصوت

# linkLabel2.Text
source: None
ar_sy: إلغاء الكل

# linkLabel1.Text
source: All
ar_sy: الكل

# checkBox_noize.Text
source: Noize
ar_sy: التشويش

# checkBox_triangle.Text
source: Trianlge
ar_sy: المثلث

# checkBox_dmc.Text
source: DMC
ar_sy: الدي إم سي

# checkBox_sq2.Text
source: Square 2
ar_sy: المربع 2

# checkBox_sq1.Text
source: Square 1
ar_sy: المربع 1

# $this.Text
source: Audio Settings
ar_sy: خيارات الصوت
