Repository: ywjno/mynes-code
Catalog: trunk/MyNes/Forms/FormDetectAndDownloadFromTheGameDB.*.resx
Languages: ar_sy

# label1.Text
source: Platform
ar_sy: المنصة

# checkBox_rename_rom.Text
source: Rename rom using "Title"
ar_sy: إعادة تسمية اللعبة بإستخدام إسم اللعبة

# button_start.Text
source: &Start
ar_sy: ال&بدء

# button3.Text
source: &Cancel/Stop
ar_sy: إل&غاء\التوقف

# tabPage1.Text
source: Overview
ar_sy: معلومات عن اللعبة

# label3.Text
source: And save the text files in this folder:
ar_sy: و إحفظ الملفات في هذا المجلد

# checkBox_add_overview.Text
source: Include "Overview" as rom info
ar_sy: تحميل معلومات اللعبة

# tabPage2.Text
source: Boxart Back
ar_sy: الغلاف الخلفي

# radioButton_boxart_back_to_snaps.Text
source: Snapshots
ar_sy: الصور

# radioButton_boxart_back_to_covers.Text
source: Covers
ar_sy: الكوفر

# label4.Text
source: And save the image files in this folder:
ar_sy: و إحفظ الملفات في هذا المجلد

# checkBox_add_boxart_back.Text
source: Include "Boxart Back" as roms:
ar_sy: تنزيل الغلاف الخلفي من أجل:

# tabPage3.Text
source: Boxart Front
ar_sy: الغلاف الأمامي

# radioButton_boxart_front_to_snaps.Text
source: Snapshots
ar_sy: الصور

# radioButton_boxart_front_to_covers.Text
source: Covers
ar_sy: الكوفر

# checkBox_include_boxart_front.Text
source: Include "Boxart Front" as roms:
ar_sy: تنزيل الغلاف الأمامي من أجل

# label6.Text
source: And save the image files in this folder:
ar_sy: و إحفظ الملفات في هذا المجلد

# tabPage4.Text
source: Fanart
ar_sy: صور من المعجبين

# radioButton_fanart_to_snaps.Text
source: Snapshots
ar_sy: الصور

# radioButton_fanart_to_covers.Text
source: Covers
ar_sy: الكوفر

# checkBox_include_fanart.Text
source: Include "Fanart" as roms:
ar_sy: تنزيل صور المعجبين من اجل:

# checkBox_limit_download_fanart.Text
source: Limit download to one file only (faster, reduce disk space required)
ar_sy: حدد التنزيلات لملف واحد فقط لتخفيف المساحة و زيادة السرعة

# label8.Text
source: And save the image files in this folder:
ar_sy: و إحفظ الملفات في هذا المجلد

# tabPage5.Text
source: Banners
ar_sy: الإعلانات أو الملصقات

# radioButton_banners_to_snaps.Text
source: Snapshots
ar_sy: الصور

# radioButton_banners_to_covers.Text
source: Covers
ar_sy: الكوفر

# checkBox_include_banners.Text
source: Include "Banners" as roms:
ar_sy: تنزيل الإعلانات من أجل:

# checkBox_limit_download_banners.Text
source: Limit download to one file only (faster, reduce disk space required)
ar_sy: حدد التنزيلات لملف واحد فقط لتخفيف المساحة و زيادة السرعة

# label10.Text
source: And save the image files in this folder:
ar_sy: و إحفظ الملفات في هذا المجلد

# tabPage6.Text
source: Screenshots
ar_sy: الصور الملتقطة

# radioButton1_screenshots_to_snaps.Text
source: Snapshots
ar_sy: الصور

# radioButton_screenshots_to_covers.Text
source: Covers
ar_sy: الكوفر

# checkBox_include_screenshots.Text
source: Include "Screenshots" as roms:
ar_sy: تنزيل الصور الملتقطة من اجل:

# checkBox_limit_download_screenshots.Text
source: Limit download to one file only (faster, reduce disk space required)
ar_sy: حدد التنزيلات لملف واحد فقط لتخفيف المساحة و زيادة السرعة

# label12.Text
source: And save the image files in this folder:
ar_sy: و إحفظ الملفات في هذا المجلد

# checkBox_clear_snapshots_table.Text
source: Clear snapshots table first
ar_sy: إفراغ جدول الصور أولاً

# checkBox_clear_covers_table.Text
source: Clear covers table first
ar_sy: إفراغ جدول الكوفر أولاً

# button_set_all.Text
source: Set all (default)
ar_sy: تنزيل الكل

# button_set_master_folder.Text
source: Assign master folder (auto set all folders)
ar_sy: تعيين المجلدات كلها بنقرة واحدة

# checkBox_turboe.Text
source: TURBO SPEED
ar_sy: زيادة السرعة

# groupBox_status.Text
source: Progress
ar_sy: التقدم

# label_status_sub.Text
source: Click start to begin.
ar_sy: إنقر على زر البدء

# label_status_master.Text
source: Click start to begin.
ar_sy: إنقر على زر البدء

# groupBox_general.Text
source: Detecting configuration
ar_sy: إعدادات البحث و التعيين

# groupBox3.Text
source: Comparing
ar_sy: المقارنة

# checkBox_matchCase.Text
source: Match case
ar_sy: مطابقة الحالة

# checkBox_matchWord.Text
source: Match word
ar_sy: مطابقة الكلمة

# groupBox2.Text
source: Text search type
ar_sy: نوع البحث النصي

# radioButton_startWith.Text
source: Start with
ar_sy: يبدأ مع

# radioButton_endwith.Text
source: End with
ar_sy: ينتهي مع

# radioButton_contains.Text
source: Contains
ar_sy: يحوي

# groupBox1.Text
source: Search mode
ar_sy: وضعية البحث

# radioButton_searchmode_rominfile.Text
source: Search mode: Entry in file
ar_sy: إسم اللعبة في العنوان

# radioButton_searchmode_both.Text
source: Search mode: both
ar_sy: الإثنان معاً

# radioButton_searchmode_fileinrom.Text
source: Search mode: file in Entry
ar_sy: العنوان في إسم اللعبة

# checkBox_clear_info_table.Text
source: Clear info table first
ar_sy: إفراغ جدول المعلومات أولاً

# checkBox_useNameWhenPathNotValid.Text
source: &Use entry name when the path is not valid.
ar_sy: إستخدم إسم اللعبة عندما يكون مسار ملف اللعبة غير صالح

# checkBox_useRomNameInstead.Text
source: &Use entry name instead of entry file name
ar_sy: إستخدم إسم اللعبة بدلاً من إسم ملف اللعبة

# groupBox4.Text
source: This service is powered by
ar_sy: هذه الخدمة مقواة من

# $this.Text
source: Detect And Download From TheGamesDB.net
ar_sy: التحديد و التنزيل من TheGamesDB.net
