Repository: ywjno/mynes-code
Catalog: trunk/MyNes/Forms/FormLauncher.*.resx
Languages: ar_sy

# tabPage_game.Text
source: Game
ar_sy: معلومات اللعبة

# tabPage_snapshots.Text
source: Snapshots
ar_sy: الصور

# tabPage_covers.Text
source: Covers
ar_sy: الكوفر

# tabPage_info.Text
source: Info
ar_sy: معلومات

# tabPage_manuals.Text
source: Manuals
ar_sy: الكتب الإلكترونية

# toolStripButton1.Text
source: NEW
ar_sy: جديد

# toolStripButton1.ToolTipText
source: Create new database using the NesCartDB file (database.xml file). After that, you can assign files to the entries.
ar_sy: إنشاء قاعدة بيانات جديدة

# toolStripButton2.Text
source: ASSIGN
ar_sy: تعيين ملفات

# toolStripButton2.ToolTipText
source: Assign files to the database entries. This process will scan folders for nes files that matches the entries. Also there's an option allows to add the files that not match as new entries.
ar_sy: تعيين ملفات للعناصر الموجودة في قاعدة البيانات

# toolStripButton7.Text
source: ADD
ar_sy: إضافة

# toolStripButton7.ToolTipText
source: Add files to the database. If entries match file(s), these entries get updated. Otherwise files not found in database get added as new entries/entry.
ar_sy: إضافة ملفات، إذا كان هناك ملفات مطابقة لعناصر سيتم تعيينها

# toolStripButton5.Text
source: DETECT
ar_sy: تحديد

# toolStripButton5.ToolTipText
source: Detect snapshots/covers/info for games. Games with files exist can be used only.
ar_sy: تحديد ملفات إضافية للعناصر الملفات الإضافية هي إما الصور، الكوفر، المعلومات أو الكتب الإلكترونية

# toolStripButton4.Text
source: FIND
ar_sy: بحث

# toolStripButton4.ToolTipText
source: Find games using advanced search
ar_sy: البحث عن ألعاب ضمن قاعدة البيانات مع خيارات متقدمة

# toolStripTextBox_find.ToolTipText
source: Search by name
ar_sy: البحث باستخدام إسم اللعبة

# toolStripSplitButton1.Text
source: SETTINGS
ar_sy: الإعدادات

# autoMinimizeToolStripMenuItem.Text
source: Auto Minimize
ar_sy: التصغير التلقائي

# autoMinimizeToolStripMenuItem.ToolTipText
source: Auto minimize the launcher when starting a game.
ar_sy: التصغير التلقائي للمستعرض عند تشغيل لعبة

# cycleImagesOnGameInfoToolStripMenuItem.Text
source: Cycle images on game info
ar_sy: تدوير الصور في نافذة معلومات اللعبة

# rememberSelectionToolStripMenuItem.Text
source: Remember selection
ar_sy: تذكر العنصر المختار

# rememberSelectionToolStripMenuItem.ToolTipText
source: Indicate if the launcher should remeber last selcted entry next time you open the launcher.
ar_sy: تذكر اللعبة المختارة من القائمة المرة المقبلة

# showLauncherAtAppStartToolStripMenuItem.Text
source: Show Launcher at app start
ar_sy: تشغيل المستعرض عند تشغيل البرنامج

# StatusLabel.Text
source: Ready.
ar_sy: جاهز.

# toolStripLabel1.Text
source: SHOW
ar_sy: العرض

# Button_mode_all.Text
source: ALL
ar_sy: الكل

# Button_mode_all.ToolTipText
source: Show all games in database.
ar_sy: عرض كافة الألعاب في قاعدة البيانات

# Button_mode_database.Text
source: DATABASE
ar_sy: قاعدة البيانات

# Button_mode_database.ToolTipText
source: Show games of NesCartDB database only
ar_sy: عرض الألعاب التي تنتمي ل NesCartDB فقط

# Button_mode_notDB.Text
source: NOT DB
ar_sy: ليست في قاعدة البيانات

# Button_mode_notDB.ToolTipText
source: Show games that not in NesCart database.
ar_sy: عرض الألعاب التي لا تنتمي ل NesCartDB

# Button_mode_files.Text
source: FILES
ar_sy: الملفات

# Button_mode_files.ToolTipText
source: Show games that exist on disk
ar_sy: عرض الألعاب التي لها ملفات موجودة على القرص. هذه الألعاب التي يمكن تشغيلها فقط

# Button_mode_missing.Text
source: MISSING
ar_sy: المفقودة

# Button_mode_missing.ToolTipText
source: Show games with no file assigned
ar_sy: عرض الألعاب التي ليس لها ملفات

# toolStripButton3.Text
source: PLAY
ar_sy: تشغيل

# toolStripButton3.ToolTipText
source: Play selected game.
ar_sy: تشغيل اللعبة المختارة

# toolStripButton8.Text
source: INFO
ar_sy: معلومات

# toolStripButton8.ToolTipText
source: Selected game info
ar_sy: عرض معلومات عن اللعبة المختارة

# toolStripButton9.Text
source: DELETE
ar_sy: حذف

# toolStripButton9.ToolTipText
source: Delete selected entries
ar_sy: حذف العناصر المختارة

# $this.Text
source: My Nes Launcher
ar_sy: My Nes مستعرض
