Repository: ywjno/mynes-code
Catalog: trunk/MyNes/Forms/FormBoardsList.*.resx
Languages: ar_sy

# label3.Text
source: Supported and have known issues
ar_sy: معدومة و لكن يوجد مشاكل

# label2.Text
source: Not Supported
ar_sy: ليست مدعومة

# label1.Text
source: Supported
ar_sy: مدعومة

# button1.Text
source: &Close
ar_sy: إ&غلاق

# columnHeader1.Text
source: Mapper #
ar_sy: رقم المبر

# columnHeader2.Text
source: Board Name
ar_sy: إسم اللوحة

# columnHeader5.Text
source: Is Supported
ar_sy: مدعومة

# columnHeader6.Text
source: Has Issues
ar_sy: يوجد مشاكل

# columnHeader3.Text
source: Issues
ar_sy: مشاكل

# $this.Text
source: Boards List
ar_sy: قائمة اللوحات
