Repository: ywjno/mynes-code
Catalog: trunk/MyNes/LanguageResources/Resource.*.resx
Languages: ar_sy

# Button_No
source: &No
ar_sy: &لا

# Button_Stop
source: &Stop
ar_sy: &توقف

# Button_Yes
source: &Yes
ar_sy: &نعم

# Column_Property
source: Property
ar_sy: الخاصية

# Column_Value
source: Value
ar_sy: القيمة

source: ERROR
ar_sy: خطأ

# Filter_Image
source: Image (*.jpg;*.png;*.bmp;*.gif;*.jpeg;*.tiff;*.tga)|*.jpg;*.png;*.bmp;*.gif;*.jpeg;*.tiff;*.tga
ar_sy: صورة (*.jpg;*.png;*.bmp;*.gif;*.jpeg;*.tiff;*.tga)|*.jpg;*.png;*.bmp;*.gif;*.jpeg;*.tiff;*.tga

# Filter_InfoFile
source: Info file (*.txt;*.rtf;*doc)|*.txt;*.rtf;*.doc;|Text file (*.txt)|*.txt|RTF (*.rtf)|*.rtf|DOC (*.doc)|*.doc
ar_sy: ملف معلومات (*.txt;*.rtf;*doc)|*.txt;*.rtf;*.doc;|Text file (*.txt)|*.txt|RTF (*.rtf)|*.rtf|DOC (*.doc)|*.doc

# Filter_MyNesDatabase
source: My Nes Database (*.mndb)|*.mndb
ar_sy: My Nes قاعدة بيانات (*.mndb)|*.mndb

# MessageCaption_ApplyLanguage
source: Apply Language Interface
ar_sy: تفعيل نصوص اللغة

# MessageCaption_Detect
source: Detect
ar_sy: تحديد

# MessageCaption_FindGames
source: Find Games
ar_sy: البحث عن الألعاب

# MessageCaption_RemoveCode
source: Remove code
ar_sy: حذف شيفرة

# MessageCaption_RemoveImage
source: Remove Image
ar_sy: حذف صورة

# MessageCaption_RemoveInfoFile
source: Remove Info file
ar_sy: حذف ملف معلومات

# MessageCaption_RemoveManual
source: Remove Manual
ar_sy: حذف كتاب إلكتروني

# MessageCheckBox_RemoveFileFromDiskToo
source: Remove file from disk too. Be carefull !!
ar_sy: إحذف الملف من القرص أيضاً. كن حذراً !!

# Message_AreYouSure
source: Are you sure ?
ar_sy: هل انت متأكد ؟

# Message_AreYouSureToRemoveAllImages
source: Are you sure you want to delete all images associated to the entry from the database ? This can't be undone.
ar_sy: هل انت متأكد من حذف كافة الصور من القائمة ؟ هذه العملية لا يمكن التراجع عنها

# Message_AreYouSureToRemoveAllInfoFiles
source: Are you sure you want to delete all info files associated to the entry from the database ? This can't be undone.
ar_sy: هل أنت متأكد من حذف كافة ملفات التعليمات من القائمة ؟ هذه العملية لا يمكن التراجع عنها

# Message_AreYousureToRemoveAllManuals
source: Are you sure you want to delete all manuals associated to the entry from the database ? This can't be undone.
ar_sy: هل أنت متأكد من حذف كافة الكتب الإلكترونية من القائمة ؟ هذه العملية لا يمكن التراجع عنها

# Message_AreYouSureToRemoveImage
source: Are you sure you want to remove this image from database ? This can't be undone.
ar_sy: هل أنت متأكد من حذف هذه الصورة من القائمة ؟ هذه العملية لا يمكن التراجع عنها

# Message_AreYouSureToRemoveInfoFile
source: Are you sure you want to remove this info file from database ? This can't be undone.
ar_sy: هل أنت متأكد من حذف ملف التعليمات من القائمة ؟ هذه العملية لا يمكن التراجع عنها

# Message_AreYouSuretoRemoveManual
source: Are you sure you want to remove this manual from database ? This can't be undone.
ar_sy: هل أنت متأكد من حذف الكتاب الإلكتروني من القائمة ؟ هذه العملية لا يمكن التراجع عنها

# Message_AreYouSureYouWantToDeleteSelectedFodlers
source: Are you sure you want to delete selected fodlers ?
ar_sy: هل أنت متأكد من حذف المجلدات المختارة من القائمة ؟

# Message_AreYouSureYouWantToStopCurrentProgress
source: Are you sure you want to stop current progress ?
ar_sy: هل أنت متأكد من إيقاف العملية ؟

# Message_CodeAlreadyExistInTheList
source: Code is already exist in the list
ar_sy: الشيفرة موجودة في القائمة

# Message_Done
source: Done !
ar_sy: تم

# Message_DoYouWantToCreateThisFolder
source: Do you want to create this folder ?
ar_sy: هل تريد إنشاء هذا المجلد ؟

# Message_InfoCopiedIntoTheClipboard
source: Info copied into the Clipboard !!
ar_sy: تم نسخ المعلومات إلى الذاكرة

# Message_NesIsOff
source: Nes Is Off
ar_sy: المحاكي لا يعمل

# Message_NoCodeInTheListToSave
source: No code in the list to save !
ar_sy: لا يوجد أية شيفرة للحفظ

# Message_NoExtensionAddedYet
source: No extension added yet, please fill the extensions field or click the Reset button to reset extensions.
ar_sy: لم يتم إضافة أية إمتداد بعد، الرجاء إدخال الإمتدادات في الحقل أولاً

# Message_NoFolderToSearch
source: No folder to search, please add at least one folder.
ar_sy: لا يوجد أية مجلد للبحث الرجاء إضافة مجلد واحد على الأقل

# Message_NoGameSelected
source: No game selected.
ar_sy: لم يتم إختيار أي لعبة

# Message_PleaseEnterTheSearchWordFirst
source: Please enter the search word first.
ar_sy: الرجاء إدخال كلمة البحث أولاً

# Message_PleaseSelectTheInputDeviceFirst
source: Please select the input device first.
ar_sy: الرجاء إختيار جهاز الإدخال أولاً

# Message_PleaseSelectTheSearchByColumnFirst
source: Please select the search by column first.
ar_sy: الرجاء تحديد عنصر البحث في

# Message_ThereIsNoCodeInTheList
source: There is no code in the list.
ar_sy: لا يوجد اي شيفرة في القائمة

# Message_TheSnapshotsFolderIsntExistAt
source: The Snapshots folder isn't exist at
ar_sy: مجلد الصور غير موجود في

# Message_TheSRAMFolderIsntExistAt
source: The SRAM folder isn't exist at
ar_sy: مجلد السيف رام غير موجود في

# Message_TheSTATEFolderIsntExistAt
source: The STATE folder isn't exist at
ar_sy: مجلد ملفات الحالة غير موجود في

# Message_ThisFileIsNotMyNesGameGenieCodesListFile
source: This file is not My Nes Game Genie codes list file
ar_sy: هذا الملف غير مدعوم

# Message_UnableToCreateTheFolder
source: Unable to create the folder
ar_sy: لم يتمكن من إنشاء المجلد

# Message_UNABLETOSHOWIMAGE
source: UNABLE TO SHOW IMAGE !!
ar_sy: لم يتمكن من عرض الصورة

# Message_YouMustRestartTheProgramToApplyLanguage
source: You must restart My Nes to apply selected language interface
ar_sy: عليك إعادة تشغيل البرنامج لتفعيل نصوص اللغة المختارة

# Message_YouMustSekectOneFolderToSearch
source: You must add at least one folder to search !\nPlease click on the Add button to add a folder to scan.
ar_sy: الرجاء إدخال مجلد واحد على الأقل للبحث

# Status_CancelIn
source: Cancel in
ar_sy: إلغاء بعد

# Status_Detected
source: DETECTED
ar_sy: عُينت

# Status_Detecting
source: Detecting
ar_sy: جاري التعيين

# Status_Seconds
source: seconds.
ar_sy: ثانية

# Text_AddFolderToTheScanList
source: Add folder to the scan list
ar_sy: إضافة مجلد إلى قائمة البحث

# Text_NeverPlayed
source: Never Played
ar_sy: لم تلعب بعد

# Text_OneTime
source: 1 Time
ar_sy: مرة واحدة

# Text_PressAKeyFor
source: Press a key for
ar_sy: إضغط زراً لأجل

# Text_Times
source: Times
ar_sy: مرة

# Text_UnableToRemoveFile
source: Unable to remove file
ar_sy: لم يتمكن من حذف الملف

# Title_AddMoreImages
source: Add more images
ar_sy: إضافة المزيد من الصور

# Title_AddMoreInfoFiles
source: Add more info files
ar_sy: إضافة المزيد من ملفات التعليمات

# Title_AddMoreManuals
source: Add more manuals
ar_sy: إضافة المزيد من الكتب الإلكترونية

# Title_Cartridge
source: Cartridge
ar_sy: الشريط

# Title_ChangeTheSnaphotsFolder
source: Change the Snaphots folder
ar_sy: تغيير مجلد الصور

# Title_ChangeTheSRAMFolder
source: Change the SRAM folder
ar_sy: تغيير مجلد السيف رام

# Title_ChangeTheStateSavesFolder
source: Change the state saves folder
ar_sy: تغيير مجلد ملفات الحالة

# Title_CHRCount
source: CHR Count
ar_sy: CHR عدد

# Title_CHRSize
source: CHR Size
ar_sy: CHR حجم

# Title_DataBase
source: DataBase
ar_sy: قاعدة البيانات

# Title_DetectCovers
source: Detect Covers
ar_sy: تحديد الكوفر

# Title_DetectInfoFiles
source: Detect Info Files
ar_sy: تحديد ملفات المعلومات

# Title_DetectManuals
source: Detect Manuals
ar_sy: تحديد الكتب الإلكترونية

# Title_DetectSnapshots
source: Detect Snapshots
ar_sy: تحديد الصور

# Title_EnterComment
source: Enter comment
ar_sy: أدخل تعليقاً

# Title_FileInfo
source: File Info
ar_sy: ملف معلومات

# Title_GameGenieCode
source: Game Genie Code
ar_sy: شيفرة جيم جيني

# title_GameInfo
source: Game info
ar_sy: معلومات اللعبة

# Title_GameInfoFromNesCartDatabase
source: Game Info From NesCart Database
ar_sy: المعلومات من NesCart

# Title_HasBattery
source: Has Battery
ar_sy: فيه بطارية

# Title_HasTrainer
source: Has Trainer
ar_sy: فيه ترينر

# Title_INESHeader
source: INES Header
ar_sy: INES ملف

# Title_IsPlaychoice10
source: Is Playchoice 10
ar_sy: هل هو Playchoice 10

# Title_IsVSUnisystem
source: Is VS Unisystem
ar_sy: هل هو VS Unisystem

# Title_MapperNumber
source: Mapper Number
ar_sy: رقم المبر

# Title_Mirroring
source: Mirroring
ar_sy: الإنعكاس

# Title_NewInfoFile
source: New info file
ar_sy: ملف معلومات جديد

# Title_Path
source: Path
ar_sy: المسار

# Title_PRGCount
source: PRG Count
ar_sy: PRG عدد

# Title_PRGSize
source: PRG Size
ar_sy: PRG حجم

# Title_SaveMyNesDatabaseFile
source: Save My Nes Database file
ar_sy: حفظ ملف قاعدة بيانت

# Title_Size
source: Size
ar_sy: الحجم

source: Alternative Name
ar_sy: الإسم المحلي

source: Board Mapper
ar_sy: مابر البورد

source: Board Pcb
ar_sy: البورد Pcb

source: Board Type
ar_sy: نوع البورد

# Button_Delete
source: &Delete
ar_sy: &حذف

# Button_DontDelete
source: Do&n't Delete
ar_sy: &لا تحذف

# Button_RecordSound
source: &Record sound
ar_sy: &تسجيل الصوت

# Button_StopSoundRecording
source: &Stop sound recording
ar_sy: &توقيف تسجيل الصوت

source: Catalog
ar_sy: الكاتالوغ

source: Class
ar_sy: الصنف

source: Date Dumped
ar_sy: تاريخ السحب

source: Developer
ar_sy: المطوّر

source: Dump
ar_sy: السحب

source: Dumper
ar_sy: الشخص الذي سحب

# Filter_MyNesState
source: My Nes State (*.mns)|*.mns
ar_sy: My Nes ملف حالة (*.mns)|*.mns

# Filter_Rom
source: Supported file types (*.nes;*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz)|*.nes;*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz|INES (*.nes)|*.nes|Archive (*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz)|*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz
ar_sy: الأنواع المدعومة (*.nes;*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz)|*.nes;*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz|INES (*.nes)|*.nes|Archive (*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz)|*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz

# Filter_Wav
source: Wav file (*.wav)|*.wav
ar_sy: Wav ملف (*.wav)|*.wav

source: Last Played
ar_sy: أخر مرة لعبت

# MessageCaption_CreateNewDatabase
source: Create New Database
ar_sy: إنشاء قاعدة بيانات

# MessageCaption_DeleteEntries
source: Delete entries
ar_sy: حذف العناصر

# MessageCheckBox_DontDeleteNesCartEntries
source: Don't delete NesCart entries
ar_sy: لا تحذف عناصر NesCart

# Message_AnotherOperationInProgress
source: Another Database operation in progress. Please try again later.
ar_sy: هناك عملية أخرى جارية الرجاء المحاولة لاحقاً

# Message_AreYouSureYouWantToCreateNewDB
source: Are you sure you want to create a new database ? This will erase all entries and info such as snapshots.
ar_sy: هل أنت متأكد من إنشاء قاعدة بيانات جديدة؟ هذه العملية ستمحي كافة البيانات كالعناصر و الصور و الكوفر و ملفات التعليمات و الكتب الالكترونية

# Message_AreYouSureYouWantToDeleteSelectedEntries
source: Are you sure you want to delete selected entries from the database ? This can't be undone.
ar_sy: هل أنت متأكد من حذف العناصر المختارة ؟ هذه العملية لا يمكن التراجع عنها

# Message_GameFileNotExistOrNoFileAssignedToThisGameYet
source: Game file not exist or no file assigned to this game yet.
ar_sy: الملف غير موجود أو غير محدد بعد

# Message_GameGenieCantBeUSedWhileEmuOf
source: Game Genie can be configured only during game run time. Please open the game you want to config the Game Genie for.
ar_sy: لا يمكن إعداد الجيم جيني حتى تقوم بتشغيل لعبة أولاً

# Message_NoDbLoadedYet
source: No database loaded yet ! Please click on NEW button to create a database.
ar_sy: لا يوجد أية قاعدة بيانات محملة بعد، أنقر على زر الجديد لإنشاء قاعدة بيانات جديدة

# Message_NoEntrySelectedToDelete
source: No entry selected to delete.
ar_sy: لم يتم إختيار أية عنصر للحذف

# Message_PleaseSelectOneGameToOpenLocation
source: Please select one game to open location.
ar_sy: الرجاء إختيار لعبة واحدة لفتح المجلد الحاوي

# Message_PleaseSelectOneGameToPlay
source: Please select one game to play.
ar_sy: الرجاء إختيار لعبة واحدة للعب

# Message_PleaseSelectOneGameToShowInfoOf
source: Please select one game to show info of.
ar_sy: الرجاء إختيار لعبة واحدة لعرض التعليمات لها

# Message_ThisFileIsNoLongerExistDoYouWantToDeleteItFromTheRecentList
source: This file is no longer exist. Do you want to delete it from the recent list ?
ar_sy: هذا الملف غير موجود ، هل تريد حذفه من القائمة ؟

# Message_YouNeedToHardResetCurrentGameToApplyRegionSettings
source: You need to hard reset current game to apply region settings
ar_sy: عليك إعادة تشغيل اللعبة لتفعيل خيار المنطقة

source: Name
ar_sy: الإسم

source: Path
ar_sy: المسار

source: Play Time
ar_sy: مدة اللعب

source: Played
ar_sy: لُعبت

source: Players
ar_sy: عدد اللاعبين

source: Publisher
ar_sy: الموزع

source: Rating
ar_sy: التقييم

source: Region
ar_sy: المنطقة

source: Release Date
ar_sy: تاريخ الإصدار

source: Size
ar_sy: الحجم

# Status_DeletingEntries
source: Deleting Entries ...
ar_sy: جاري تعيين العناصر ...

# Status_Done
source: Done.
ar_sy: تم

# Status_Ready
source: Ready.
ar_sy: جاهز

# Status_UpdatingColumnsInTheDatabase
source: Updating columns in the database ...
ar_sy: جاري تحديث معلومات الأعمدة

source: System
ar_sy: النظام

# Title_AddFilesToTheDatabase
source: Add files to the database.
ar_sy: إضافة ملفات إلى قاعدة البيانات

# Title_LoadStateAs
source: Load state as
ar_sy: تحميل الحالة بإسم

# Title_OpenRom
source: Open rom
ar_sy: فتح لعبة

# Title_SaveStateAs
source: Save state as
ar_sy: حفظ الحالة بإسم

# Title_SaveWavFile
source: Save wav file
ar_sy: حفظ ملف صوت

source: Build
ar_sy: البناء

source: Core Version
ar_sy: نسخة الكور

source: Revision
ar_sy: الإصدار

source: Version
ar_sy: النسخة

# About_CopyrightNotice
source: A Nintendo Entertainment System / Family Computer (Nes/Famicom) Emulator written in C#. Copyright © Ala Ibrahim Hadid 2009 - 2015 Email: mailto:ahdsoftwares@hotmail.com This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/>. Important!! ------------ NES is either a trademark or registered trademark of Nintendo of America Inc. Famicom is either a trademark or registered trademark of Nintendo Co., LTD. All other trademarks are property of their respective owners. My Nes is not affiliated with or endorsed by any of the companies mentioned. Icons: ------- Mark James http://www.famfamfam.com/lab/icons/silk/ This work is licensed under a Creative Commons Attribution 2.5 License. [ http://creativecommons.org/licenses/by/2.5/ ] MLV: ------ Managed ListView control. Copyright © 2013 Ala Ibrahim Hadid. This is an article about this project includes all the information. http://www.codeproject.com/Articles/538518/Managed-ListView MMB: ------- Managed Message Box Copyright © 2013 Ala Hadid. https://sourceforge.net/projects/managedmessagebox/ 7-Zip ------ 7-Zip Copyright (C) 1999-2010 Igor Pavlov. Licenses for files are: 1) 7z.dll: GNU LGPL + unRAR restriction 2) All other files: GNU LGPL The GNU LGPL + unRAR restriction means that you must follow both GNU LGPL rules and unRAR restriction rules. Note: You can use 7-Zip on any computer, including a computer in a commercial organization. You don't need to register or pay for 7-Zip. ZLIP ----- Copyright (c) 2006-2007, ComponentAce http://www.componentace.com All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. Neither the name of ComponentAce nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. SlimDX -------- Copyright (c) 2007-2010 SlimDX Group Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE. SlimDX Media --------------- All of the SlimDX media is covered by the Creative Commons Attribution-Share Alike 3.0 License: http://creativecommons.org/licenses/by-sa/3.0/us/ You are free: * To Share - to copy, distribute, display, and perform the work * To Remix - to make derivative works Under the following conditions: * Attribution - You must attribute the work in the manner specified by the author or licensor (but not in any way that suggests that they endorse you or your use of the work). * Share Alike - If you alter, transform, or build upon this work, you may distribute the resulting work only under the same, similar or a compatible license. For any reuse or distribution, you must make clear to others the license terms of this work. The best way to do this is with a link to the above web page. Any of the above conditions can be waived if you get permission from the copyright holder. Apart from the remix rights granted under this license, nothing in this license impairs or restricts the author's moral rights. Sqlite.Net ---------- ADO.NET 2.0/3.5 SQLite Data Provider Version 1.0.66.0 April 18, 2010 Using SQLite 3.6.23.1 Written by Robert Simpson (robert@blackcastlesoft.com) Released to the public domain, use at your own risk! Official provider website: http://sqlite.phxsoftware.com NesCartDB ---------------- By BootGod, released at : Sat Sep 10 14:40:41 2011 Downloaded from:http://bootgod.dyndns.org:7777/home.php TheGamesDB C# API ---------------------- https://github.com/Chainsawkitten/gamesdb-csharp-api/ Authored by Chainsawkitten; github profile: <https://github.com/Chainsawkitten> A C# API for [TheGamesDB](http://thegamesdb.net/), a free open-source online database for video games. See the [API Introduction](http://wiki.thegamesdb.net/index.php?title=API_Introduction) on the wiki. Licensed under [MIT](LICENSE). Blip_Buffer 0.4.0: Band-Limited Sound Buffer -------------------------------------------- Blip_Buffer provides waveform synthesis and sample buffering with a high-level interface that allows easy generation of square waves and similar with high sound quality. Waveforms are specified by amplitude changes at times in terms of the source clock rate, then efficiently resampled to the output sample rate with adjustable low-pass and high-pass filtering. It is well-suited for emulation of the sound chips used video game consoles before the mid-1990s. Author : Shay Green <hotpop.com@blargg> Website: http://www.slack.net/~ant/ Forum : http://groups.google.com/group/blargg-sound-libs License: GNU Lesser General Public License (LGPL)
ar_sy: محاكي لنظام Nintendo Entertainment System / Family Computer (Nes/Famicom) مكتوب بلغة C# جميع الحقوق محفوظة © علاء ابراهيم حديد 2009 - 2015 إيميل: ahdsoftwares@hotmail.com هذا البرنامج مجاني، يمكنك إعادة نشره و\أو التعديل عليه تحت شروط و قيود الرخصة GNU General Public License كما صدرت من قبل المؤسسة Free Software، النسخة 3 من الرخصة، أو (حسب اختيارك) أية نسخة لاحقة. وزع هذا البرنامج على الأمل بأنه مفيد، لكن بدون أية ضمانة؛ حتى بدون الضمانة الضمنية أو الإمكانية التجارية أو الملاءمة التجارية لأي غرض معين. يجب بأن تكون قد استلمت نسخة من الرخصة GNU General Public License مع هذا البرنامج، إذا لم تكن موجودة مع البرنامج، الرجاء زيارة الموقع<http://www.gnu.org/licenses/> هام --- NES هي ماركة مسجلة من Nintendo Famicom هي ماركة مسجلة من Nintendo Co., LTD. جميع حقوق النشر الأخرى محفوظة لأصحابها هذا البرنامج لا يمد بأية صلة لشركة Nintendo أو ما يتبع لها الأيقونات: ------- Mark James http://www.famfamfam.com/lab/icons/silk/ MLV: ------ Managed ListView control. جميع الحقوق محفوظة © علاء ابراهيم حديد 2013 مقالة تتضمن كافة المعلومات عن هذه المكتبة: http://www.codeproject.com/Articles/538518/Managed-ListView MMB: ------- Managed Message Box جميع الحقوق محفوظة © علاء ابراهيم حديد 2013 https://sourceforge.net/projects/managedmessagebox/

# About_Credits
source: Author and developer: Ala Ibrahim Hadid <mailto:ahdsoftwares@hotmail.com> Special thanks to Adam Becker <mailto:beannaich@gmail.com> for the great help !
ar_sy: المؤلف و المطوّر: علاء ابراهيم حديد <mailto:ahdsoftwares@hotmail.com> شكر خاص للمساعدة الكبيرة: Adam Becker for the great help !! <mailto:beannaich@gmail.com>

# About_Links
source: Website: http://sourceforge.net/projects/mynes/ Article: http://www.codeproject.com/KB/game/MyNes_NitendoEmulator.aspx Facebook: http://www.facebook.com/pages/My-Nes/427707727244076
ar_sy: الموقع الرسمي: http://sourceforge.net/projects/mynes/ مقالة عن المشروع: http://www.codeproject.com/KB/game/MyNes_NitendoEmulator.aspx صفحة الفيس بوك: http://www.facebook.com/pages/My-Nes/427707727244076

# Message_PaletteFileCantBeFound
source: The palette file can't be found. The palette settings switched to generators. Go to Settings>Palette to configure the palettes.
ar_sy: لم يتمكن من إيجاد ملف لائحة الألوان، تم إعادة الإعدادات إلى المولدات. لتغيير إعدادات الألوان، إذهب إلى الإعدادات-الألوان

# Message_PaletteFileNotValid
source: The palette file is not valid. Switch back to generators. To config palette settings, go to Settings>Palette.
ar_sy: ملف لائحة الألوان غير صالح، تم استدخدام مولدات الألوان، لتغيير إعدادات الألوان إذهب إلى الإعدادات-الألوان

# Message_UnableToLoadPaletteFile
source: Unable to load palette file!
ar_sy: لم يتمكن من تحميل ملف الألوان !

# Message_PaletteFileNotExistOrSelected
source: Palette file not exist; please add palette file via clicking on the Add link or select Use Generator settings instead.
ar_sy: لم يتم إختيار ملف لوحة الألوان بعد ، الرجاء إختيار لملف لوحة ألوان من القائمة أو استخدم المولدات عوضاً عن الملف

# Message_ReplacePaletteFile
source: A palette file with the same name already exist, replace it ?
ar_sy: ملف لوحة ألوان بنفس الإسم موجود مسبقاً، هل تريد استبداله ؟
