Repository: ywjno/mynes-code
Catalog: trunk/MyNes/LanguageResources/Resource.*.resx
Languages: ar_sy

# Message_ThisGameHaveKnownIssues
source: This game belongs to a board/mapper that have known issues with My Nes
ar_sy: هذه اللعبة تنتمي لبورد يعاني من هذه المشاكل المعروفة مع البرنامج

# Message_ThisGameMapperMarkedAsNotSupported
source: This game mapper marked as not supported. My Nes still can run this game using default Nes configuration (mapper 0). Do you want My Nes to run this game ?
ar_sy: هذه اللعبة مسجلة على أنها غير مدعومة بالبرنامج. على كل حال يمكن للبرنامج محاولة تشغيل هذه اللعبة باستخدام إعدادات المحاكي الإفتراضية. هل تريد من البرنامج المحاولة لتشغيل هذه اللعبة ؟

# Text_AlwaysTryToRunGameWithNoSupportedMappers
source: &Always try to run game with no supported mappers, never show this message again.
ar_sy: &لا تظهر هذه الرسالة مجددا، المحاكي سيقوم دائماً بمحاولة تشغيل الألعاب الغير مدعومة

# Text_AlwaysWarnAboutIssues
source: &Always warn me about game issues
ar_sy: &حذرني دائماً من المشاكل المعروفة

# Status_AddingEntries
source: Adding entries
ar_sy: جاري إضافة السجلات

# Status_CalculatingFiles
source: Calculating files ...
ar_sy: جاري حساب عدد الملفات

# Status_DefaultEntriesFromNesCartDBGeneratedSuccessfully
source: Default entries from NesCartDB generated successfully.
ar_sy: تم إنشاء السجلات بنجاح

# Status_EntryADDED
source: Entry ADDED
ar_sy: سجل أضيف

# Status_EntryUPDATED
source: Entry UPDATED
ar_sy: سجل حُدث

# Status_FilesFound
source: file(s) found.
ar_sy: ملف وجد

# Status_GeneratingDefaultEntriesFromNesCartDB
source: Generating default entries from NesCartDB ...
ar_sy: جاري إنشاء سجلات قاعدة البيانات

# Status_LoadingEntriesFromTheDatabase
source: Loading entries from the database ...
ar_sy: جاري تحميل السجلات من قاعدة البيانات

# Status_SearchingFiles
source: Searching files ...
ar_sy: جاري البحث عن الملفات

# Status_TotalOf
source: Total of
ar_sy: حوالي

# Status_UpdatingDatabase
source: Updating database (this may take a few minutes)
ar_sy: جاري تحديث قاعدة البيانات (قد يستغرق الأمر بضع دقائق)

# Status_EntrySkipped
source: Entry SKIPPED
ar_sy: سجل تم تجاهله

# Status_Supported
source: supported.
ar_sy: مدعومة.

# Message_PleaseSelectOneResultFirst
source: Please select one result first.
ar_sy: الرجاء إختيار نتيجة واحدة

# Status_Downloading
source: Downloading
ar_sy: جاري التنزيل

# Title_ChooseWhereToDownloadTheFiles
source: Choose where to download the files
ar_sy: الرجاء إختيار أين سيتم تنزيل الملفات

# Button_Ok
source: &OK
ar_sy: &موافق

# Button_OpenLog
source: O&pen Log
ar_sy: &فتح ملف السجل

# MessageCaption_DetectAndDownloadFromTheGamesDB
source: Detect and download from TheGamesDB.net
ar_sy: التعيين و التنزيل TheGamesDB.net

# Message_LogFileSavedTo
source: Log file saved to
ar_sy: تمّ حفظ ملف السجل في

# Status_ApplyingDatabase
source: Applying to database
ar_sy: جاري الإضافة إلى قاعدة البيانات

# Message_PleaseSelectAPlatformFirst
source: Please select a platform first.
ar_sy: الرجاء إختيار منصة أولاً

# Message_TheFolderForBannersIsNotExist
source: The folder for 'Banners' is not exist.
ar_sy: المجلد الخاص بالملصقات غير موجود

# Message_TheFolderForBoxartBackIsNotExist
source: The folder for 'Boxart Back' is not exist.
ar_sy: المجلد الخاص بالغلاف الخلفي غير موجود

# Message_TheFolderForBoxartFrontIsNotExist
source: The folder for 'Boxart Front' is not exist.
ar_sy: المجلد الخاص بالغلاف الأمامي غير موجود

# Message_TheFolderForFanartIsNotExist
source: The folder for 'Fanart' is not exist.
ar_sy: المجلد الخاص بصور المعجبين غير موجود

# Message_TheFolderForOverviewIsNotExist
source: The folder for 'Overview' is not exist.
ar_sy: المجلد الخاص بمعلومات اللعبة غير موجود

# Message_TheFolderForScreenshotsIsNotExist
source: The folder for 'Screenshots' is not exist.
ar_sy: المجلد الخاص بلصور الملتقطة غير موجود
